geot0x1/stm32c071/Core/Src/main.c
#if 0
/**
  * @brief  EXTI line detection callback.
  * @param  GPIO_Pin: Specifies the port pin connected to corresponding EXTI line.
  * @retval None
  */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
    uint32_t now = htim3.Instance->CNT;
    volatile PwmMeasure *pm = NULL;

    if (GPIO_Pin == GPIO_PIN_10)
    {
        pm = &capturePB10;
    }
    else if (GPIO_Pin == GPIO_PIN_11)
    {
        pm = &capturePB11;
    }

    if (pm != NULL)
    {
        if (HAL_GPIO_ReadPin(GPIOB, GPIO_Pin) == GPIO_PIN_SET)
        {
            /* Rising edge: calculate period */
            if (pm->last_rising_timestamp != 0)
            {
                pm->last_period = (now >= pm->last_rising_timestamp) ? 
                                 (now - pm->last_rising_timestamp) : 
                                 (now + 65536 - pm->last_rising_timestamp);
            }
            pm->last_rising_timestamp = now;
        }
        else
        {
            /* Falling edge: calculate high time and duty cycle */
            if (pm->last_rising_timestamp != 0)
            {
                pm->last_high_time = (now >= pm->last_rising_timestamp) ? 
                                    (now - pm->last_rising_timestamp) : 
                                    (now + 65536 - pm->last_rising_timestamp);
                
                if (pm->last_period != 0)
                {
                    pm->duty_cycle = ((float)pm->last_high_time * 100.0f) / (float)pm->last_period;
                }
            }
            pm->last_falling_timestamp = now;
        }
    }
}
#endif
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
